{
  "irVersion": "1.0",
  "project": "coreforge",
  "repository": "https://github.com/grokify/coreforge",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-03-14",
      "highlights": [
        { "description": "Vendor-agnostic observability integration with OmniObserve (Datadog, New Relic, Dynatrace, OTLP)" },
        { "description": "SaaS marketplace infrastructure with Stripe billing and seat-based licensing" },
        { "description": "Redis-backed rate limiting with sliding window and token bucket algorithms" },
        { "description": "OAuth client management and provider abstraction for CoreAuth" }
      ],
      "added": [
        { "description": "Observability package with OmniObserve integration for metrics, traces, and logs", "commit": "ea139a6" },
        { "description": "Marketplace package with Stripe subscription and seat-based licensing", "commit": "c0ba5bd" },
        { "description": "OAuth client management service in `identity/oauthclient`", "commit": "2da5d87" },
        { "description": "CoreAPI rate limiting package with policy-based controls", "commit": "3771a54" },
        { "description": "Redis-backed rate limiter with sliding window algorithm", "commit": "0269db8" },
        { "description": "Marketplace Ent entities: License, Listing, Subscription, SeatAssignment", "commit": "db60b3c" },
        { "description": "CoreAuth provider abstraction layer for pluggable authentication", "commit": "bf5a90a" },
        { "description": "JWT claims enhancement with audience and issuer validation", "commit": "087d8dd" },
        { "description": "Session middleware improvements with context utilities", "commit": "cb60d99" }
      ],
      "documentation": [
        { "description": "Authorization PRD and TRD design documents", "commit": "95d1352" },
        { "description": "Marketplace PRD design document", "commit": "95d1352" },
        { "description": "CoreAPI and CoreAuth documentation", "commit": "95d1352" }
      ],
      "dependencies": [
        { "description": "Upgraded OmniObserve to v0.8.0 with unified entry point", "commit": "9a7280b" },
        { "description": "Added Stripe Go SDK v82 for payment processing", "commit": "9a7280b" },
        { "description": "Added Redis client for rate limiting", "commit": "9a7280b" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-03-08",
      "highlights": [
        { "description": "SpiceDB authorization provider for Zanzibar-style relationship-based access control (ReBAC)" },
        { "description": "Principal-based identity model supporting humans, agents, applications, and service principals" },
        { "description": "SCIM 2.0 user provisioning with CoreForge-compliant patch operations" },
        { "description": "Identity-authorization sync automatically maintains SpiceDB relationships on identity changes" }
      ],
      "added": [
        { "description": "SpiceDB authorization provider with embedded and remote modes", "commit": "a7d4f61" },
        { "description": "Principal identity model with type-specific extensions (Human, Agent, Application, ServicePrincipal)", "commit": "0deab0a" },
        { "description": "GitHub-style organization system with owner, admin, member roles", "commit": "b3471b6" },
        { "description": "SCIM 2.0 user provisioning endpoints with filter, patch, and bulk operations", "commit": "1f78ff0" },
        { "description": "Coreauth authentication server with Fosite-based OAuth 2.0", "commit": "d46d626" },
        { "description": "Credential and token management service for principals", "commit": "a3b02b2" },
        { "description": "Standardized API contract module with consistent error handling", "commit": "55be5d3" },
        { "description": "Coreauth CLI for server and key management operations", "commit": "803d5b1" },
        { "description": "User schema extended with profile fields (locale, timezone, avatar)", "commit": "a303ca5" },
        { "description": "RelationshipSyncer interface for identity-authorization integration", "commit": "963b3d3" },
        { "description": "No-op syncer for deployments without SpiceDB", "commit": "963b3d3" },
        { "description": "SpiceDB integration tests with embedded server", "commit": "be09d6c" }
      ],
      "changed": [
        { "description": "OAuth 2.0 implementation refactored for principal-based identity", "commit": "ffff607" }
      ],
      "removed": [
        { "description": "Casbin authorization provider (replaced by SpiceDB)", "commit": "dde3392" }
      ],
      "documentation": [
        { "description": "SpiceDB setup guide for embedded and remote modes", "commit": "a7d4f61" },
        { "description": "SpiceDB schema reference with permission inheritance model", "commit": "a7d4f61" },
        { "description": "Authorization integration patterns and middleware examples", "commit": "963b3d3" },
        { "description": "Updated module documentation for v0.2.0", "commit": "8436f16" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Batteries-included Go platform module for multi-tenant SaaS applications" },
        { "description": "Complete identity management with users, organizations, and memberships" },
        { "description": "Full OAuth 2.0 server implementation using Fosite with PKCE, client credentials, and JWT bearer grants" },
        { "description": "Session management with JWT, DPoP (RFC 9449) proof-of-possession, and BFF pattern" }
      ],
      "added": [
        { "description": "User accounts with email and Argon2id password hashing", "commit": "3907780" },
        { "description": "Organizations for multi-tenant applications with name, slug, plan, and settings", "commit": "3907780" },
        { "description": "Memberships with flexible role-based user-organization relationships", "commit": "3907780" },
        { "description": "OAuth account linking for GitHub and Google providers", "commit": "3907780" },
        { "description": "API key service for machine-to-machine authentication with scopes", "commit": "d13b7a5" },
        { "description": "OAuth 2.0 server using Fosite with Authorization Code + PKCE grant", "commit": "297ecc7" },
        { "description": "Client Credentials grant for service-to-service authentication", "commit": "297ecc7" },
        { "description": "Refresh Token grant with rotation and theft detection", "commit": "297ecc7" },
        { "description": "JWT Bearer grant (RFC 7523) for service account authentication", "commit": "297ecc7" },
        { "description": "Service accounts with RSA/EC key pairs for non-human identities", "commit": "297ecc7" },
        { "description": "Token introspection (RFC 7662) and revocation (RFC 7009) endpoints", "commit": "297ecc7" },
        { "description": "JWT service supporting HS256, RS256, and ES256 algorithms", "commit": "4397d6a" },
        { "description": "DPoP (RFC 9449) proof-of-possession token binding implementation", "commit": "b086e49" },
        { "description": "Backend for Frontend (BFF) pattern with server-side sessions", "commit": "205886b" },
        { "description": "GitHub and Google OAuth social login handlers", "commit": "4ea5e42" },
        { "description": "JWT Bearer and API key authentication middleware", "commit": "2b84467" },
        { "description": "Role-based access control (RBAC) with organization-scoped permissions", "commit": "edf630e" },
        { "description": "Casbin provider for advanced policy rules", "commit": "edf630e" },
        { "description": "Simple provider for lightweight permission checking", "commit": "edf630e" },
        { "description": "HTTP middleware for route protection (Chi and stdlib)", "commit": "edf630e" },
        { "description": "Feature flag engine with boolean, percentage, and user list flags", "commit": "edb959d" },
        { "description": "Organization-scoped feature flag evaluation", "commit": "edb959d" },
        { "description": "In-memory feature flag store for development and testing", "commit": "edb959d" },
        { "description": "PostgreSQL RLS policy generation and session variable helpers", "commit": "7240382" },
        { "description": "Tenant isolation for multi-tenant data separation", "commit": "7240382" },
        { "description": "Ent ORM integration with transaction helpers for tenant context", "commit": "7240382" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions CI workflow for build and test", "commit": "0f8c44c" },
        { "description": "GitHub Actions lint workflow with golangci-lint", "commit": "0f8c44c" },
        { "description": "Dependabot configuration for Go modules and GitHub Actions", "commit": "0f8c44c" }
      ],
      "documentation": [
        { "description": "Comprehensive MkDocs documentation site with Material theme", "commit": "87a8489" },
        { "description": "Getting started guides: installation, quickstart, configuration", "commit": "87a8489" },
        { "description": "Identity module documentation: users, organizations, memberships, API keys", "commit": "87a8489" },
        { "description": "OAuth 2.0 documentation: apps, authorization code, client credentials, service accounts, tokens", "commit": "87a8489" },
        { "description": "Integration guides: existing apps and migration", "commit": "87a8489" },
        { "description": "API reference and Ent schema documentation", "commit": "87a8489" },
        { "description": "PRD and TRD design documents for authentication and OAuth", "commit": "28dffa6" },
        { "description": "README with badges, quick start examples, and module structure", "commit": "a91b98e" }
      ]
    }
  ]
}
